performance/reports/archive/runs/normal-day-2026-08-19T08-44-20/summary.txt
     ✓ login 200
     ✓ unread count 200
     ✓ board list 200
     ✓ post detail 200
     ✓ notif list 200
     ✓ meal today 200
     ✓ scrap 2xx
     ✓ hot daily 200
     ✓ chat rooms 200
     ✓ friend list 200
     ✓ post list 200
     ✓ timetable today 200
     ✓ chat messages 200
     ✓ post reaction 2xx
     ✓ chat read 200
     ✓ post create 2xx
     ✓ comment create 2xx
     ✓ user info 200
     ✓ my posts 200
     ✓ read one 200
     ✓ comment list 200
     ✓ read all 200
     ✓ comment reaction 200
     ✓ ws handshake 101
     ✓ post search 200
     ✓ meal month 200
     ✓ refresh 200
     ✓ received reqs 200
     ✓ post update 200
     ✓ logout 200
     ✓ post delete 200

     auth_token_refreshes...........: 34      0.055125/s
     chat_ws_messages_sent..........: 851     1.37974/s
     chat_ws_rtt....................: avg=2.22s   min=15ms    med=1.75s    max=9.6s     p(90)=4.74s    p(95)=6.04s   p(99)=8.56s   
     checks.........................: 100.00% ✓ 14427     ✗ 0    
     ✓ { phase:measure }............: 100.00% ✓ 8189      ✗ 0    
     ✓ { phase:rampdown }...........: 100.00% ✓ 2593      ✗ 0    
     ✓ { phase:warmup }.............: 100.00% ✓ 3645      ✗ 0    
     data_received..................: 648 MB  1.1 MB/s
     data_sent......................: 5.8 MB  9.5 kB/s
     http_req_blocked...............: avg=13.81µs min=1.42µs  med=6.29µs   max=14.7ms   p(90)=10.8µs   p(95)=14.62µs p(99)=290.71µs
     http_req_connecting............: avg=4.71µs  min=0s      med=0s       max=14.54ms  p(90)=0s       p(95)=0s      p(99)=200.42µs
     http_req_duration..............: avg=4.22s   min=1.96ms  med=4.03s    max=29.3s    p(90)=7.89s    p(95)=9.08s   p(99)=13.24s  
       { expected_response:true }...: avg=4.22s   min=1.96ms  med=4.03s    max=29.3s    p(90)=7.89s    p(95)=9.08s   p(99)=13.24s  
     ✓ { feature:auth }.............: avg=2.17s   min=22.3ms  med=1.57s    max=8.93s    p(90)=4.73s    p(95)=6.18s   p(99)=8.72s   
     ✓ { feature:board }............: avg=4.1s    min=2.29ms  med=4.06s    max=11.69s   p(90)=7.47s    p(95)=8.4s    p(99)=9.64s   
     ✓ { feature:chat }.............: avg=4.12s   min=2.27ms  med=4.27s    max=12.24s   p(90)=7.58s    p(95)=8.44s   p(99)=9.75s   
     ✓ { feature:comment }..........: avg=5.44s   min=2.24ms  med=4.72s    max=29.3s    p(90)=11.06s   p(95)=13.37s  p(99)=16.01s  
     ✓ { feature:friend }...........: avg=4.16s   min=2.53ms  med=4.35s    max=13.45s   p(90)=7.44s    p(95)=8.69s   p(99)=10.28s  
     ✓ { feature:hot }..............: avg=4.22s   min=8.9ms   med=4.09s    max=11.82s   p(90)=7.78s    p(95)=8.78s   p(99)=10.12s  
     ✓ { feature:mypage }...........: avg=4.15s   min=2.84ms  med=4.15s    max=11.2s    p(90)=7.69s    p(95)=8.69s   p(99)=11.1s   
     ✓ { feature:notification }.....: avg=4.07s   min=2.29ms  med=4.21s    max=12.66s   p(90)=7.53s    p(95)=8.71s   p(99)=10.11s  
     ✓ { feature:post }.............: avg=3.87s   min=1.96ms  med=3.78s    max=13.41s   p(90)=7.36s    p(95)=8.42s   p(99)=10.08s  
     ✓ { feature:reaction }.........: avg=4.13s   min=14.75ms med=4.11s    max=11.67s   p(90)=7.56s    p(95)=8.72s   p(99)=9.86s   
     ✓ { feature:school }...........: avg=4.15s   min=2.76ms  med=3.9s     max=9.41s    p(90)=7.14s    p(95)=8.83s   p(99)=9.38s   
     ✓ { feature:scrap }............: avg=4.36s   min=15.38ms med=4.36s    max=11.62s   p(90)=8.2s     p(95)=9.9s    p(99)=10.78s  
     ✓ { feature:timetable }........: avg=4.16s   min=2.48ms  med=4.32s    max=9.2s     p(90)=7.04s    p(95)=8.18s   p(99)=8.99s   
     ✓ { op:auth }..................: avg=2.17s   min=22.3ms  med=1.57s    max=8.93s    p(90)=4.73s    p(95)=6.18s   p(99)=8.72s   
     ✗ { op:read,phase:measure }....: avg=5.13s   min=3.76ms  med=4.87s    max=21.59s   p(90)=8.37s    p(95)=9.39s   p(99)=13.4s   
     ✗ { op:write,phase:measure }...: avg=5.59s   min=62.88ms med=5.28s    max=13s      p(90)=8.73s    p(95)=9.6s    p(99)=11.55s  
     ✓ { page:0 }...................: avg=2.8s    min=1.96ms  med=2.36s    max=12.09s   p(90)=5.74s    p(95)=7.33s   p(99)=9.07s   
     ✓ { page:1 }...................: avg=2.69s   min=2.17ms  med=2.17s    max=10.12s   p(90)=5.37s    p(95)=7.02s   p(99)=8.86s   
     ✓ { page:2 }...................: avg=2.89s   min=2.44ms  med=2.47s    max=10.18s   p(90)=5.59s    p(95)=7.36s   p(99)=8.55s   
     ✓ { page:3 }...................: avg=3.15s   min=2.49ms  med=2.76s    max=9.01s    p(90)=6.05s    p(95)=6.74s   p(99)=8.17s   
     ✓ { page:4 }...................: avg=2.72s   min=2.66ms  med=2.18s    max=10.13s   p(90)=6.11s    p(95)=7.62s   p(99)=9.04s   
     ✓ { phase:measure }............: avg=5.16s   min=3.76ms  med=4.89s    max=21.59s   p(90)=8.41s    p(95)=9.41s   p(99)=13.35s  
     ✓ { phase:rampdown }...........: avg=3.36s   min=1.96ms  med=3.06s    max=20.69s   p(90)=7.96s    p(95)=9.42s   p(99)=12.66s  
     ✓ { phase:warmup }.............: avg=2.74s   min=4.28ms  med=2.09s    max=29.3s    p(90)=5.92s    p(95)=7.09s   p(99)=13.29s  
     http_req_failed................: 0.00%   ✓ 0         ✗ 14275
     ✓ { phase:measure }............: 0.00%   ✓ 0         ✗ 8101 
     ✓ { phase:rampdown }...........: 0.00%   ✓ 0         ✗ 2433 
     ✓ { phase:warmup }.............: 0.00%   ✓ 0         ✗ 3741 
     http_req_receiving.............: avg=1.6ms   min=23.18µs med=288.87µs max=201.43ms p(90)=811.28µs p(95)=3.29ms  p(99)=63.22ms 
     http_req_sending...............: avg=42.1µs  min=5.58µs  med=34.33µs  max=561.21µs p(90)=70.96µs  p(95)=86.46µs p(99)=150.98µs
     http_req_tls_handshaking.......: avg=0s      min=0s      med=0s       max=0s       p(90)=0s       p(95)=0s      p(99)=0s      
     http_req_waiting...............: avg=4.22s   min=1.76ms  med=4.03s    max=29.21s   p(90)=7.89s    p(95)=9.08s   p(99)=13.23s  
     http_reqs......................: 14275   23.144281/s
     ✓ { feature:auth }.............: 286     0.463696/s
     ✓ { feature:board }............: 1326    2.149865/s
     ✓ { feature:chat }.............: 1027    1.665091/s
     ✓ { feature:comment }..........: 2588    4.195965/s
     ✓ { feature:friend }...........: 239     0.387494/s
     ✓ { feature:hot }..............: 1326    2.149865/s
     ✓ { feature:mypage }...........: 156     0.252925/s
     ✓ { feature:notification }.....: 656     1.063583/s
     ✓ { feature:post }.............: 6137    9.950014/s
     ✓ { feature:reaction }.........: 264     0.428027/s
     ✓ { feature:school }...........: 106     0.171859/s
     ✓ { feature:scrap }............: 76      0.12322/s
     ✓ { feature:timetable }........: 88      0.142676/s
     ✓ { op:auth }..................: 286     0.463696/s
     ✓ { op:read }..................: 12936   20.97334/s
     ✓ { op:write }.................: 1053    1.707245/s
     ✓ { page:0 }...................: 726     1.177075/s
     ✓ { page:1 }...................: 275     0.445862/s
     ✓ { page:2 }...................: 156     0.252925/s
     ✓ { page:3 }...................: 97      0.157268/s
     ✓ { page:4 }...................: 72      0.116735/s
     ✓ { phase:measure }............: 8101    13.134278/s
     ✓ { phase:rampdown }...........: 2433    3.944661/s
     ✓ { phase:warmup }.............: 3741    6.065342/s
     iteration_duration.............: avg=28.11s  min=1.29s   med=20.93s   max=1m35s    p(90)=59.49s   p(95)=1m6s    p(99)=1m19s   
     iterations.....................: 3245    5.261169/s
     ✓ { phase:measure }............: 0       0/s
     ✓ { phase:rampdown }...........: 0       0/s
     ✓ { phase:warmup }.............: 0       0/s
     phase_iterations...............: 3245    5.261169/s
     ✓ { phase:measure }............: 1865    3.023754/s
     ✓ { phase:rampdown }...........: 665     1.078175/s
     ✓ { phase:warmup }.............: 715     1.159241/s
     vus............................: 1       min=0       max=200
     vus_max........................: 200     min=200     max=200
     ws_connecting..................: avg=2.9s    min=2.07ms  med=2.55s    max=9.27s    p(90)=6s       p(95)=7.53s   p(99)=8.9s    
     ws_msgs_received...............: 903     1.464048/s
     ws_msgs_sent...................: 1155    1.87262/s
     ws_session_duration............: avg=25.44s  min=15.53s  med=25.53s   max=35.52s   p(90)=31.91s   p(95)=32.99s  p(99)=34.93s  
     ws_sessions....................: 152     0.24644/s